### Exercício 03 – Manipulando dados com Pandas
a)Crie um programa em pandas para ler o arquivo em Excel vendas.xlsx e
b)coloque em um dataframe.
c)Visualize o cabeçalho dos dados;
d)Visualize as últimas linhas;
e)Escreva um programa para renomear o cabeçalho da tabela com os
f)seguintes nomes:

In [1]:
# importando a bilioteca do pandas

import pandas as pd

# Mapear o caminho e o nome do documento
caminho = '../gabriel-eloi-python/Arquivos/Vendas (5).xlsx'

# Atribuir os dados a um dataframe
df = pd.read_excel(caminho)

# Visualizar o cabeçalho
df.head()

,Coluna 1,Coluna 2,Coluna 3,Coluna 4,Coluna 5,Coluna 6
0,2014-01-01,Bernardo de Sousa,Supervisor de Vendas Pl,ACME,AL,3276.20
1,2014-01-01,Bernardo de Sousa,Supervisor de Vendas Pl,ACME,AP,3005.86
2,2014-01-01,Bernardo de Sousa,Supervisor de Vendas Pl,ACME,MA,8568.54
3,2014-01-01,Bernardo de Sousa,Supervisor de Vendas Pl,ACME,MG,1344.27
4,2014-01-01,Bernardo de Sousa,Supervisor de Vendas Pl,ACME,MS,7585.04

In [2]:
# ultima linha
df.tail()

,Coluna 1,Coluna 2,Coluna 3,Coluna 4,Coluna 5,Coluna 6
130461,2016-12-31,Liz Azevedo Santos,Vendedor Pl.,Planet Express,PI,1829.39
130462,2016-12-31,Liz Azevedo Santos,Vendedor Pl.,Planet Express,PR,2378.48
130463,2016-12-31,Liz Azevedo Santos,Vendedor Pl.,Planet Express,RO,4488.47
130464,2016-12-31,Liz Azevedo Santos,Vendedor Pl.,Planet Express,RR,1543.66
130465,2016-12-31,Liz Azevedo Santos,Vendedor Pl.,Planet Express,SC,9820.71

In [3]:
df = df.rename(columns={
    'Coluna 1':'Data',
    'Coluna 2':'Vendedor',
    'Coluna 3':'Cargo',
    'Coluna 4':'Cliente',
    'Coluna 5':'UF',
    'Coluna 6':'Vendas'
}
)

df.head()

        Data           Vendedor                    Cargo Cliente  UF   Vendas
0 2014-01-01  Bernardo de Sousa  Supervisor de Vendas Pl    ACME  AL  3276.20
1 2014-01-01  Bernardo de Sousa  Supervisor de Vendas Pl    ACME  AP  3005.86
2 2014-01-01  Bernardo de Sousa  Supervisor de Vendas Pl    ACME  MA  8568.54
3 2014-01-01  Bernardo de Sousa  Supervisor de Vendas Pl    ACME  MG  1344.27
4 2014-01-01  Bernardo de Sousa  Supervisor de Vendas Pl    ACME  MS  7585.04

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130466 entries, 0 to 130465
Data columns (total 6 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   Data      130466 non-null  datetime64[ns]
 1   Vendedor  130466 non-null  object
 2   Cargo     130466 non-null  object
 3   Cliente   130466 non-null  object
 4   UF        130466 non-null  object
 5   Vendas    130466 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 6.0+ MB

In [5]:
# Calculo soma
df['Vendas'].sum()

718501609.25

In [6]:
# Calculo media
df['Vendas'].mean()

5507.194282418408

In [7]:
# Calculo máximo
df['Vendas'].max()

10000.0

In [8]:
#Calculo mínimo

df['Vendas'].min()

1000.01

In [9]:
# Calculo de contagem de colunas
df['Vendas'].count()

130466

#### Filtrando dados de uma forma mais fácil

In [18]:
#1 Selecionar a coluna de interesse
# para mostrar todos os cargos, devemos remover todos os cargos duplicados, para assim mostrar todos os cargos sem ter nenhum duplicado

df_cargos = df['Cargo'].drop_duplicates()

#2 Converter o df_cargos em lista

cargos = df_cargos.to_list()
cargos

#3 Filtrar o dataframe utilizando a lista cargos

for cargo in cargos:
    df_final = df[df['Cargo'] == cargo] # filtrar de acordo com os cargos
    caminho = '../gabriel-eloi-python/relatorios-exercicio-03/' # caminho da pasta
    arquivo = cargo + '.xlsx' # Nome do arquivo
    df_final.to_excel(caminho + arquivo) # Gerando um arquivo em Excel

### Monte para as colunas Vendedor, Cliente, UF

In [25]:
# removendo os duplicados
df_vendedor = df['Vendedor'].drop_duplicates()

# Transformando os dados em lista
vendedores = df_vendedor.tolist()
vendedores

for vendedor in vendedores:
    df_final = df[df['Vendedor'] == vendedor] # o Vendedor com letra maiscula é a busca na tabela de dados da coluna Vendedor, e o vendedor com letra minuscula é a variavel que esta percorrendo no for
    caminho = './relatorios-exercicio-03/relatorios vendedores/'
    arquivo = vendedor + '.xlsx'
    df_final.to_excel(caminho + arquivo)